kiooss/esp32s3-gamebox/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: ESP32-S3-WROOM-1-N16R8 = 16 MB quad flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: N16R8 = 8 MB OCTAL SPI. OCT 模式是关键，选错则 PSRAM 不可用。
# 启用后 GPIO33~37 被占用，不可作普通 IO —— 详见 docs/hardware.md
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU 跑满 240MHz。默认是 160MHz —— 白扔 1/3 算力，模拟器要靠这个。
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# printf 需要完整浮点格式化
CONFIG_NEWLIB_NANO_FORMAT=n

# FreeRTOS tick 提到 1000 Hz。默认 100 Hz 意味着 vTaskDelay 最小粒度 10ms，
# 而 NES 一帧才 16.7ms —— 配速会被抖成锯齿。
CONFIG_FREERTOS_HZ=1000
